In [1]:
import mysql.connector as dd

In [2]:
mydb = dd.connect(host = 'localhost', user = 'root', passwd = 'admin')

In [3]:
cursor = mydb.cursor()

In [4]:
cursor.execute('SHOW DATABASES')

In [5]:
cursor.fetchall()

[('information_schema',),
 ('main',),
 ('mysql',),
 ('performance_schema',),
 ('sys',)]

In [7]:
cursor.execute('CREATE DATABASE Employee')

In [8]:
cursor.execute('SHOW DATABASES')

In [12]:
cursor.execute('USE Employee')

In [21]:
cursor.execute("CREATE TABLE emp_data (emp_id INT, NAME VARCHAR(30),SALARY INT(30),PRIMARY KEY(emp_id))")

In [30]:
cursor.execute("INSERT INTO emp_data VALUES (102,'ZAZA',10000,'2011-02-11')")

In [31]:
cursor.execute("INSERT INTO emp_data VALUES (103,'Akin',20,'2022-09-31')")

In [33]:
cursor.execute("INSERT INTO emp_data VALUES (104,'ZAZA',10000,'2014-02-12')")

In [34]:
cursor.execute("SELECT * FROM emp_data")

In [36]:
cursor.execute("DESC emp_data")

In [37]:
cursor.fetchall()

[('emp_id', b'int', 'NO', 'PRI', None, ''),
 ('NAME', b'varchar(30)', 'YES', '', None, ''),
 ('SALARY', b'int', 'YES', '', None, ''),
 ('joining_date', b'varchar(40)', 'YES', '', None, '')]

## Q-1. Write an SQL query to print details of the Workers who have joined in Febâ€™2014.

In [58]:
cursor.execute("SELECT * FROM emp_data WHERE joining_date >= '2014-02-01' AND joining_date  <= '2014-02-28'")

In [59]:
cursor.fetchall()

[(104, 'ZAZA', 10000, '2014-02-12')]

## Q-2. Write an SQL query to fetch duplicate records having matching data in some fields of a table

In [60]:
#adding duplicate values to existing table

In [61]:
cursor.execute("SELECT * FROM emp_data")

In [65]:
cursor.execute("INSERT INTO emp_data VALUES (105, 'ZAZA', 10000, '2014-02-12')")

In [62]:
cursor.fetchall()

[(101, 'ZEKE', 10000, '2014-03-22'),
 (102, 'ZAZA', 10000, '2011-02-11'),
 (103, 'Akin', 20, '2022-09-31'),
 (104, 'ZAZA', 10000, '2014-02-12')]

# Q-2. Write an SQL query to fetch duplicate records having matching data in some fields of a table.

In [66]:
cursor.execute('SELECT * FROM emp_data GROUP BY NAME,SALARY HAVING COUNT(*)>1')

In [67]:
cursor.fetchall()

[(102, 'ZAZA', 10000, '2011-02-11')]

In [68]:
#Duplicate record above based on two columns

# Q-3. How to remove duplicate rows from Employees table.

In [75]:
cursor.execute("DELETE e1 FROM emp_data e1,emp_data e2 WHERE e1.NAME = e2.NAME AND e1.emp_id >e2.emp_id ")

In [77]:
cursor.execute("SELECT * FROM emp_data")

In [78]:
cursor.fetchall()

[(101, 'ZEKE', 10000, '2014-03-22'),
 (102, 'ZAZA', 10000, '2011-02-11'),
 (103, 'Akin', 20, '2022-09-31')]